---
type: ViewDisplayDepthCueing
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ViewDisplayDepthCueing

`Autodesk.Revit.DB.ViewDisplayDepthCueing` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetStartEndPercentages | 2017 | `public void SetStartEndPercentages ( int startPercentage , int endPercentage )` |
| Property | EnableDepthCueing | 2017 | `public bool EnableDepthCueing { get ; set ; }` |
| Property | EndPercentage | 2017 | `public int EndPercentage { get ; }` |
| Property | FadeTo | 2017 | `public int FadeTo { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StartPercentage | 2017 | `public int StartPercentage { get ; }` |